Revit 2024 API
BuiltInFailures.RevisionFailures.RevisionSettingsDuplicateName Property
 More than one Revisons have the same name %1!s!.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RevisionSettingsDuplicateName { get; }
Visual Basic
Public Shared ReadOnly Property RevisionSettingsDuplicateName As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RevisionSettingsDuplicateName {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RevisionFailures Class
Autodesk.Revit.DB Namespace